print("Вас приветствует бот помощник Адам. Я могу подобрать вам фильм на вечер, порекомендовать музыку, рассказать шутку или просто поговорить с вами")

while True: 
    print("Пункт 1 - Подборка фильма")
    print("Пункт 2 - Рекомендация музыки")
    print("Пункт 3 - Расскажи шутку")
    print("Пункт 4 - Простое общение со мной")
    print("Пункт 5 - напишите 5 для выхода")
    command = input("Выберите нужный пункт: ")
    command = command.lower()
    if command == "выход" or command == "5":
        print("Работа закончена, спасиьо что обратились")
        break

    elif command == "подборка фильма" or command == "1":
        print("Выберите какой жанр фильма вам интересен из нашего каталога: комедия, ужасы, детектив")
        film_genre = input("Какой жанр фильма хотели бы посмотреть? ")
        film_genre = film_genre.lower()
        if film_genre == "комедия":
            film = ("Очень страшное кино, Один дома, Няньки")
            print("Вот что нашёл по вашему запросу из комедий:", film)
        elif film_genre == "ужасы":
            film = ("Чужой, Выход 8, Чернобыль")
            print("Вот что нашёл по вашему запросу из ужасов:", film)
        elif film_genre == "детектив":
            film = ("Чёрный ящик, Шестое чувство, Казнь")
            print("Вот что нашёл по вашему запросу из детективов:", film)

    elif command == "Рекомендация музыки" or command == "2":
        print("Выберите какой жанр музыки вам интересен из нашего каталога: рок, поп, метал")
        genre = input("Какой жанр музыки хотели бы послушать? ")
        genre = genre.lower()
        if genre == "рок":
           track = ("Queen, Nirvana, The Beatles")
           print("Вот что нашёл по вашему запросу из Рок групп:", track)
        if genre == "поп":
           track = ("Руки Вверх!, Иванушки Интернешнл, ABBA")
           print("Вот что нашёл по вашему запросу из Поп групп:", track)
        if genre == "метал":
           track = ("Metallica, Korn, Slipknot")
           print("Вот что нашёл по вашему запросу из Метал групп:", track)

    elif command == "Расскажи шутку" or command == "3":
        joke = ("«Да тут работы на пять минут!» — фраза, после которой программист исчезает на три дня,"
                 "Главное правило любого программитса - работает не трогай,"
                 "На геометрии чувствую себя, как в Dark Souls: умираю на каждом углу."
                 )
        print("Вот несколько шуток из моего каталога:", joke)

    elif command == "Простое общение со мной" or command == "4":
        print("Хорошо давай просто пообщаемся")
        while True:
            user = input("Напишите своё сообщение: ")
            user = user.lower()

            if user == "В меню":
                print("Открываю меню выбора")
                break
            elif "Привет" in user:
                print("Привет! Чем могу помочь или обсудить?")
            elif "Как дела?" in user:
                print ("У меня всегда всё хорошо, у тебя как?")
            elif "Плохо" in user:
                print("Не беспокойся всё наладится")
            elif "Хорошо" in user:
                print("Это очень радует")
